import matplotlib.pyplot as plt
import numpy as np

# y = ax + b 
rng = np.random
x = rng.rand(50)*10
a = rng.rand() * 10
b = rng.randn(50)
y = 2*x+b

plt.scatter(x, y)
plt.xlabel("x")
plt.ylabel("Y")
plt.grid()
plt.title("our relationship")
plt.show() #ข้อมูลจะไม่เพิ่มอย่างถี่ละ จะเป็นการกระจายเเทน เพราะเรา random ค่า b

#สรุป a จะเกี่ยวกับ การขึ้น หรือ ลง ของกราฟ หาก  a = + กราฟจะขึ้น หาก a = - กราฟจะลง
#b จะเกี่ยวกับการกระจาย หาก b เป็นค่าคงตัว มันจะเป็นเส้นตรง เเต่หาก b เป็นค่า random มันจะเกิดการกระจาย จนไม่ใช่เส้นตรง (ไม่สนว่า b เป็น + หรือ - เเต่ถ้าเป็นค่าrandom มันจะเป็นการกระจาย ที่ไม่ใช่เส้นตรง)
#เพิ่มเติม ถึงเเม้ว่า b จะเป็นค่า random เเต่ถ้า a เยอะขึ้น จะทำให้เห็นการกระจายน้อยลง เพราะความกระจายมันเกิดขึ้นในหน่วยเล็กๆ เเตถ้าสมมติ a > 10 กราฟจะเริ่มเป็นหน่วยของหลักร้อย ทำให้อาจมองไม่เห็นหรือมองเห็นความกระจายได้น้อยลง ก็เหมือนมองไกลๆเเล้วเห็นเป็นเส้นตรงเหมือนเดิม เพราะมันต่างกันเเค่ในหน่วยอะตอมอะ
#เอาง่ายๆก็คือ a ส่งผลมากเกินไป ทำให้ไม่เห็นความกระจาย หรือ มองเห็นได้น้อยลง

#ประโยชน์คือ เวลาเอา data predict มาเทียบกับเส้น linear regression ถ้า data มีเเนวโฯ้มเป็นเส้นตรง ตาม Linear ถือว่าดี ถ้าต่างกันมาก ถือว่าไม่ดี โอกาส predict ผิดพลาดสูง